const moment = require("moment-timezone");

module.exports = {
    config: {
        name: "autotime",
        version: "1.0.0",
        role: 0,
        author: "Admin",
        description: "সেট করা সময় অনুযায়ী স্বয়ংক্রিয়ভাবে বার্তা পাঠানো!",
        usePrefix: false
    },

    onStart: async function() {
        const nam = [
            { timer: "12:00:00 AM", message: ["__এখন রাত ১১টা বাজে, কিছু কিছু মানুষ chrome-এ ঢুকছে😩"] },
            { timer: "01:00:00 AM", message: ["__এখন রাত ১২টা বেজে গেল, সবার কাজ হয়ে গেল😒🤟"] },
            { timer: "02:00:00 AM", message: ["__এখন রাত ১টা বাজে, সবাই মনে হয় ঘুমিয়ে গেছে নাকি কাজ করতেছে😛"] },
            { timer: "03:00:00 AM", message: ["__এখন রাত ২টা বাজে, যারা প্রেম করে তারা জেগে আছে🤭🤭"] },
            { timer: "04:00:00 AM", message: ["__এখন রাত ৩টা বাজে, কিছু মানুষ প্রেম করে😩, কিছু মানুষ ঘুমায়😑, আমি শুধু জেগে আছি😶"] },
            { timer: "05:00:00 AM", message: ["__এখন রাত ৪টা বাজে, একটু পর ফজরের আজান দিবে, নামাজ পড়ে নিও সবাই"] },
            { timer: "06:00:00 AM", message: ["__এখন ভোর ৫টা বাজে, সবাই নামাজ পড়েছো তো?🤨 না পড়লে পড়ে নাও ok🤗"] },
            { timer: "07:00:00 AM", message: ["__এখন সকাল ৬টা বাজে, ঘুম থেকে ওঠো সবাই আর পড়তে বসো😾😾"] },
            { timer: "08:00:00 AM", message: ["__এখন সকাল ৭টা বাজে, সবাই দাঁত মেজে ব্রেকফাস্ট করে নাও!😒😊"] },
            { timer: "09:00:00 AM", message: ["__এখন সকাল ৮টা বাজে, সবার স্কুল-কলেজের সময় হয়েছে হয়তো, চলে যেও কিন্তু🤗"] },
            { timer: "10:00:00 AM", message: ["__এখন সকাল ৯টা বাজে, মন দিয়ে কাজ ও পড়াশোনা করো সবাই🤗❤️"] },
            { timer: "11:00:00 AM", message: ["__এখন সকাল ১০টা বাজে, মিস করছি তোমাদের🥺🥺 কখন আসবে তোমরা🥺"] },
            { timer: "12:00:00 PM", message: ["__এখন সকাল ১১টা বাজে, বাচ্চাদের স্কুল ছুটি হয়ে গেছে হয়তো"] },
            { timer: "01:00:00 PM", message: ["__এখন দুপুর ১২টা বাজে, সবাই বাসায় যাও🤗❤️"] },
            { timer: "02:00:00 PM", message: ["__এখন দুপুর ১টা বাজে, সবাই কাজ বন্ধ করে গোসল করে নাও😒"] },
            { timer: "03:00:00 PM", message: ["__এখন দুপুর ২টা বাজে, সবাই দুপুরের খাবার খেয়ে নাও🥰"] },
            { timer: "04:00:00 PM", message: ["__এখন দুপুর ৩টা বাজে, সবাই একটু ঘুমাও😒"] },
            { timer: "05:00:00 PM", message: ["__এখন বিকেল ৪টা বাজে, আসরের আজান দিলে সবাই নামাজ পড়ে নিও🥀"] },
            { timer: "06:00:00 PM", message: ["__এখন বিকেল ৫টা বাজে, কেউ খেলাধুলা করলে মাঠে যাও😻"] },
            { timer: "07:00:00 PM", message: ["__এখন সন্ধ্যা ৬টা বাজে, সবাই হাতমুখ ধুয়ে কিছু খেয়ে নাও এবং পরিবারের সাথে সময় কাটাও😍"] },
            { timer: "08:00:00 PM", message: ["__এখন সন্ধ্যা ৭টা বাজে, সবাই এখন এশার নামাজ পড়ে নাও🤗🤗"] },
            { timer: "09:00:00 PM", message: ["__এখন রাত ৮টা বাজে, একটু পড়তে বসো সবাই"] },
            { timer: "10:00:00 PM", message: ["__এখন রাত ৯টা বাজে, সবাই কি শুয়ে পড়লা? গ্রুপে আসো সবাই🙂"] },
            { timer: "11:00:00 PM", message: ["__এখন রাত ১০টা বাজে, সবাই আড্ডা দিচ্ছে। আমার বউ নাই ভাই🥺 ঘুমও আসে না, আড্ডাও দিতে পারি না🥺 কি জ্বালা"] }
        ];

        setInterval(async () => {
            const currentTime = moment().tz("Asia/Dhaka").format("hh:mm:ss A");
            const findTime = nam.find(i => i.timer === currentTime);
            
            if (findTime) {
                const allThreads = await global.api.getThreadList(100, null, ["INBOX"]);
                for (const thread of allThreads) {
                    if (thread.isGroup && thread.threadID) {
                        api.sendMessage(findTime.message[Math.floor(Math.random() * findTime.message.length)], thread.threadID);
                    }
                }
            }
        }, 1000);
    }
};